# У неудачливого бухгалтера всё опять идёт наперекосяк: ему приносят такие большие счета, что числа не помещаются на бумаге. 

# Напишите программу, которая считала бы для него, сколько цифр во вводимом числе. Обратите внимание, что число 0 имеет одну цифру.

# Пример:
# Введите число: 567
# Ответ: 3

# Введите число: 1203
# Ответ: 4

digit = int(input('Введите число, а я скажу сколько в нём цифр: '))
count = 0

while  digit > 0:
    count += 1
    digit = digit // 10
print(count)


