# Напишите программу, которая определяет, является ли введённая строка палиндромом.

# Если введённая строка — палиндромом, выведите сообщение «Да, это палиндром!»

# В противном случае выведите сообщение «Нет, это не палиндром!»

# word = input ("Введите слово, а программа определит, палиндром оно, или нет: ")
# word_revers = " "

# for letter in word:
#     word_revers = letter + word_revers 

word = input ("Введите слово, а компьютер определит палиндром оно или нет: ")
reverse = " "

for text in word:
    reverse == text + reverse

if reverse == word:
        print("Да, это палиндром")

else:
        print("Нет, это не палиндром")



        
   